MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C32C0AGV20000/mcu.h
typedef struct stc_hdmicec_rcdtlh_field
{
    union {
        struct {
            __IO   uint8_t  RCDTLH               :8;
        };
        struct {
            __IO   uint8_t  RCDTLH0              :1;
            __IO   uint8_t  RCDTLH1              :1;
            __IO   uint8_t  RCDTLH2              :1;
            __IO   uint8_t  RCDTLH3              :1;
            __IO   uint8_t  RCDTLH4              :1;
            __IO   uint8_t  RCDTLH5              :1;
            __IO   uint8_t  RCDTLH6              :1;
            __IO   uint8_t  RCDTLH7              :1;
        };
    };
} stc_hdmicec_rcdtlh_field_t;

typedef struct stc_hdmicec_rcckd_field
{
    union {
        struct {
            __IO  uint16_t  CKDIV                :12;
            __IO  uint16_t  CKSEL                :1;
            __IO  uint16_t  RESERVED0            :3;
        };
        struct {
            __IO  uint16_t  CKDIV0               :1;
            __IO  uint16_t  CKDIV1               :1;
            __IO  uint16_t  CKDIV2               :1;
            __IO  uint16_t  CKDIV3               :1;
            __IO  uint16_t  CKDIV4               :1;
            __IO  uint16_t  CKDIV5               :1;
            __IO  uint16_t  CKDIV6               :1;
            __IO  uint16_t  CKDIV7               :1;
            __IO  uint16_t  CKDIV8               :1;
            __IO  uint16_t  CKDIV9               :1;
            __IO  uint16_t  CKDIV10              :1;
            __IO  uint16_t  CKDIV11              :1;
            __IO  uint16_t  RESERVED1            :4;
        };
    };
} stc_hdmicec_rcckd_field_t;

typedef struct stc_hdmicec_rcrhw_field
{
    union {
        struct {
            __IO   uint8_t  RCRHW                :8;
        };
        struct {
            __IO   uint8_t  RCRHW0               :1;
            __IO   uint8_t  RCRHW1               :1;
            __IO   uint8_t  RCRHW2               :1;
            __IO   uint8_t  RCRHW3               :1;
            __IO   uint8_t  RCRHW4               :1;
            __IO   uint8_t  RCRHW5               :1;
            __IO   uint8_t  RCRHW6               :1;
            __IO   uint8_t  RCRHW7               :1;
        };
    };
} stc_hdmicec_rcrhw_field_t;

typedef struct stc_hdmicec_rcrc_field
{
        __IO   uint8_t  RC                       :1;
        __IO   uint8_t  RESERVED0                :3;
        __IO   uint8_t  RCIE                     :1;
        __IO   uint8_t  RESERVED1                :3;
} stc_hdmicec_rcrc_field_t;

typedef struct stc_hdmicec_rcle_field
{
        __IO   uint8_t  LES                      :1;
        __IO   uint8_t  LEL                      :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  EPE                      :1;
        __IO   uint8_t  LESE                     :1;
        __IO   uint8_t  LELE                     :1;
        __IO   uint8_t  LESIE                    :1;
        __IO   uint8_t  LELIE                    :1;
} stc_hdmicec_rcle_field_t;

typedef struct stc_hdmicec_rclesw_field
{
    union {
        struct {
            __IO   uint8_t  RCLESW               :8;
        };
        struct {
            __IO   uint8_t  RCLESW0              :1;
            __IO   uint8_t  RCLESW1              :1;
            __IO   uint8_t  RCLESW2              :1;
            __IO   uint8_t  RCLESW3              :1;
            __IO   uint8_t  RCLESW4              :1;
            __IO   uint8_t  RCLESW5              :1;
            __IO   uint8_t  RCLESW6              :1;
            __IO   uint8_t  RCLESW7              :1;
        };
    };
} stc_hdmicec_rclesw_field_t;

typedef struct stc_hdmicec_rclelw_field
{
    union {
        struct {
            __IO   uint8_t  RCLELW               :8;
        };
        struct {
            __IO   uint8_t  RCLELW0              :1;
            __IO   uint8_t  RCLELW1              :1;
            __IO   uint8_t  RCLELW2              :1;
            __IO   uint8_t  RCLELW3              :1;
            __IO   uint8_t  RCLELW4              :1;
            __IO   uint8_t  RCLELW5              :1;
            __IO   uint8_t  RCLELW6              :1;
            __IO   uint8_t  RCLELW7              :1;
        };
    };
} stc_hdmicec_rclelw_field_t;

/*******************************************************************************
* HWWDT_MODULE
*******************************************************************************/
typedef struct stc_hwwdt_wdg_ctl_field
{
        __IO  uint32_t  INTEN                    :1;
        __IO  uint32_t  RESEN                    :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_hwwdt_wdg_ctl_field_t;

typedef struct stc_hwwdt_wdg_ris_field
{
        __IO  uint32_t  RIS                      :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_hwwdt_wdg_ris_field_t;

/*******************************************************************************
* I2CSLAVE_MODULE
*******************************************************************************/
typedef struct stc_i2cslave_ibssr_field
{
        __IO  uint16_t  BB                       :1;
        __IO  uint16_t  SPC                      :1;
        __IO  uint16_t  RSC                      :1;
        __IO  uint16_t  ACT                      :1;
        __IO  uint16_t  TRX                      :1;
        __IO  uint16_t  RSA                      :1;
        __IO  uint16_t  RACK                     :1;
        __IO  uint16_t  FBT                      :1;
        __IO  uint16_t  TDRE                     :1;
        __IO  uint16_t  RDRF                     :1;
        __IO  uint16_t  INT                      :1;
        __IO  uint16_t  RESERVED0                :5;
} stc_i2cslave_ibssr_field_t;

typedef struct stc_i2cslave_ibscr_field
{
    union {
        struct {
            __IO  uint16_t  TIE                  :1;
            __IO  uint16_t  RIE                  :1;
            __IO  uint16_t  INTE                 :1;
            __IO  uint16_t  CNDE                 :1;
            __IO  uint16_t  WSEL                 :1;
            __IO  uint16_t  ACKE                 :1;
            __IO  uint16_t  RESERVED0            :1;
            __IO  uint16_t  RSVEN                :1;
            __IO  uint16_t  NFCNT                :2;
            __IO  uint16_t  RESERVED2            :6;
        };
        struct {
            __IO  uint16_t  RESERVED1            :8;
            __IO  uint16_t  NFCNT0               :1;
            __IO  uint16_t  NFCNT1               :1;
            __IO  uint16_t  RESERVED3            :6;
        };
    };
} stc_i2cslave_ibscr_field_t;

typedef struct stc_i2cslave_ibsadr_field
{
    union {
        struct {
            __IO   uint8_t  SA                   :7;
            __IO   uint8_t  SAEN                 :1;
        };
        struct {
            __IO   uint8_t  SA0                  :1;
            __IO   uint8_t  SA1                  :1;
            __IO   uint8_t  SA2                  :1;
            __IO   uint8_t  SA3                  :1;
            __IO   uint8_t  SA4                  :1;
            __IO   uint8_t  SA5                  :1;
            __IO   uint8_t  SA6                  :1;
            __IO   uint8_t  RESERVED0            :1;
        };
    };
} stc_i2cslave_ibsadr_field_t;

typedef struct stc_i2cslave_ibsmskr_field
{
    union {
        struct {
            __IO   uint8_t  SM                   :7;
            __IO   uint8_t  EN                   :1;
        };
        struct {
            __IO   uint8_t  SM0                  :1;
            __IO   uint8_t  SM1                  :1;
            __IO   uint8_t  SM2                  :1;
            __IO   uint8_t  SM3                  :1;
            __IO   uint8_t  SM4                  :1;
            __IO   uint8_t  SM5                  :1;
            __IO   uint8_t  SM6                  :1;
            __IO   uint8_t  RESERVED0            :1;
        };
    };
} stc_i2cslave_ibsmskr_field_t;

typedef struct stc_i2cslave_ibsdstupr_field
{
    union {
        struct {
            __IO   uint8_t  SETUP                :8;
        };
        struct {
            __IO   uint8_t  SETUP0               :1;
            __IO   uint8_t  SETUP1               :1;
            __IO   uint8_t  SETUP2               :1;
            __IO   uint8_t  SETUP3               :1;
            __IO   uint8_t  SETUP4               :1;
            __IO   uint8_t  SETUP5               :1;
            __IO   uint8_t  SETUP6               :1;
            __IO   uint8_t  SETUP7               :1;
        };
    };
} stc_i2cslave_ibsdstupr_field_t;

typedef struct stc_i2cslave_ibstdr_field
{
    union {
        struct {
            __IO   uint8_t  TDR                  :8;
        };
        struct {
            __IO   uint8_t  TDR0                 :1;
            __IO   uint8_t  TDR1                 :1;
            __IO   uint8_t  TDR2                 :1;
            __IO   uint8_t  TDR3                 :1;
            __IO   uint8_t  TDR4                 :1;
            __IO   uint8_t  TDR5                 :1;
            __IO   uint8_t  TDR6                 :1;
            __IO   uint8_t  TDR7                 :1;
        };
    };
} stc_i2cslave_ibstdr_field_t;

typedef struct stc_i2cslave_ibsrdr_field
{
    union {
        struct {
            __IO   uint8_t  RDR                  :8;
        };
        struct {
            __IO   uint8_t  RDR0                 :1;
            __IO   uint8_t  RDR1                 :1;
            __IO   uint8_t  RDR2                 :1;
            __IO   uint8_t  RDR3                 :1;
            __IO   uint8_t  RDR4                 :1;
            __IO   uint8_t  RDR5                 :1;
            __IO   uint8_t  RDR6                 :1;
            __IO   uint8_t  RDR7                 :1;
        };
    };
} stc_i2cslave_ibsrdr_field_t;

typedef struct stc_i2cslave_ibsscr_field
{
        __IO  uint16_t  RESERVED0                :1;
        __IO  uint16_t  SPCC                     :1;
        __IO  uint16_t  RSCC                     :1;
        __IO  uint16_t  RESERVED1                :7;
        __IO  uint16_t  INTC                     :1;
        __IO  uint16_t  RESERVED2                :5;
} stc_i2cslave_ibsscr_field_t;

typedef struct stc_i2cslave_ibsssr_field
{
        __IO  uint16_t  RESERVED0                :8;
        __IO  uint16_t  TDRES                    :1;
        __IO  uint16_t  RESERVED1                :7;
} stc_i2cslave_ibsssr_field_t;

