MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C32C0AGV20000/mcu.h
/*******************************************************************************
* BTIOSEL03 Registers BTIOSEL03
*   Register Definition
*******************************************************************************/
#define FM_BTIOSEL03_BTSEL0123                    *((volatile  uint8_t*)(0x40025101UL))
#define FM0P_BTIOSEL03_BTSEL0123                  *((volatile  uint8_t*)(0x40025101UL))

/*******************************************************************************
* BTIOSEL47 Registers BTIOSEL47
*   Register Definition
*******************************************************************************/
#define FM_BTIOSEL47_BTSEL4567                    *((volatile  uint8_t*)(0x40025301UL))
#define FM0P_BTIOSEL47_BTSEL4567                  *((volatile  uint8_t*)(0x40025301UL))

/*******************************************************************************
* CLK_GATING Registers CLK_GATING
*   Register Definition
*******************************************************************************/
#define FM_CLK_GATING_CKEN0                       *((volatile uint32_t*)(0x4003C100UL))
#define FM0P_CLK_GATING_CKEN0                     *((volatile uint32_t*)(0x4003C100UL))
#define FM_CLK_GATING_MRST0                       *((volatile uint32_t*)(0x4003C104UL))
#define FM0P_CLK_GATING_MRST0                     *((volatile uint32_t*)(0x4003C104UL))
#define FM_CLK_GATING_CKEN1                       *((volatile uint32_t*)(0x4003C110UL))
#define FM0P_CLK_GATING_CKEN1                     *((volatile uint32_t*)(0x4003C110UL))
#define FM_CLK_GATING_MRST1                       *((volatile uint32_t*)(0x4003C114UL))
#define FM0P_CLK_GATING_MRST1                     *((volatile uint32_t*)(0x4003C114UL))
#define FM_CLK_GATING_CKEN2                       *((volatile uint32_t*)(0x4003C120UL))
#define FM0P_CLK_GATING_CKEN2                     *((volatile uint32_t*)(0x4003C120UL))
#define FM_CLK_GATING_MRST2                       *((volatile uint32_t*)(0x4003C124UL))
#define FM0P_CLK_GATING_MRST2                     *((volatile uint32_t*)(0x4003C124UL))

/*******************************************************************************
* CRC Registers CRC
*   Register Definition
*******************************************************************************/
#define FM_CRC_CRCCR                              *((volatile  uint8_t*)(0x40039000UL))
#define FM0P_CRC_CRCCR                            *((volatile  uint8_t*)(0x40039000UL))
#define FM_CRC_CRCINIT                            *((volatile uint32_t*)(0x40039004UL))
#define FM0P_CRC_CRCINIT                          *((volatile uint32_t*)(0x40039004UL))
#define FM_CRC_CRCIN                              *((volatile uint32_t*)(0x40039008UL))
#define FM0P_CRC_CRCIN                            *((volatile uint32_t*)(0x40039008UL))
#define FM_CRC_CRCR                               *((volatile uint32_t*)(0x4003900CUL))
#define FM0P_CRC_CRCR                             *((volatile uint32_t*)(0x4003900CUL))

/*******************************************************************************
* CRG Registers CRG
*   Register Definition
*******************************************************************************/
#define FM_CRG_SCM_CTL                            *((volatile uint32_t*)(0x40010000UL))
#define FM0P_CRG_SCM_CTL                          *((volatile uint32_t*)(0x40010000UL))
#define FM_CRG_SCM_STR                            *((volatile uint32_t*)(0x40010004UL))
#define FM0P_CRG_SCM_STR                          *((volatile uint32_t*)(0x40010004UL))
#define FM_CRG_STB_CTL                            *((volatile uint32_t*)(0x40010008UL))
#define FM0P_CRG_STB_CTL                          *((volatile uint32_t*)(0x40010008UL))
#define FM_CRG_RST_STR                            *((volatile uint32_t*)(0x4001000CUL))
#define FM0P_CRG_RST_STR                          *((volatile uint32_t*)(0x4001000CUL))
#define FM_CRG_BSC_PSR                            *((volatile uint32_t*)(0x40010010UL))
#define FM0P_CRG_BSC_PSR                          *((volatile uint32_t*)(0x40010010UL))
#define FM_CRG_APBC0_PSR                          *((volatile uint32_t*)(0x40010014UL))
#define FM0P_CRG_APBC0_PSR                        *((volatile uint32_t*)(0x40010014UL))
#define FM_CRG_APBC1_PSR                          *((volatile uint32_t*)(0x40010018UL))
#define FM0P_CRG_APBC1_PSR                        *((volatile uint32_t*)(0x40010018UL))
#define FM_CRG_SWC_PSR                            *((volatile uint32_t*)(0x40010020UL))
#define FM0P_CRG_SWC_PSR                          *((volatile uint32_t*)(0x40010020UL))
#define FM_CRG_CSW_TMR                            *((volatile uint32_t*)(0x40010030UL))
#define FM0P_CRG_CSW_TMR                          *((volatile uint32_t*)(0x40010030UL))
#define FM_CRG_PSW_TMR                            *((volatile uint32_t*)(0x40010034UL))
#define FM0P_CRG_PSW_TMR                          *((volatile uint32_t*)(0x40010034UL))
#define FM_CRG_PLL_CTL1                           *((volatile uint32_t*)(0x40010038UL))
#define FM0P_CRG_PLL_CTL1                         *((volatile uint32_t*)(0x40010038UL))
#define FM_CRG_PLL_CTL2                           *((volatile uint32_t*)(0x4001003CUL))
#define FM0P_CRG_PLL_CTL2                         *((volatile uint32_t*)(0x4001003CUL))
#define FM_CRG_CSV_CTL                            *((volatile uint32_t*)(0x40010040UL))
#define FM0P_CRG_CSV_CTL                          *((volatile uint32_t*)(0x40010040UL))
#define FM_CRG_CSV_STR                            *((volatile uint32_t*)(0x40010044UL))
#define FM0P_CRG_CSV_STR                          *((volatile uint32_t*)(0x40010044UL))
#define FM_CRG_FCSWH_CTL                          *((volatile uint32_t*)(0x40010048UL))
#define FM0P_CRG_FCSWH_CTL                        *((volatile uint32_t*)(0x40010048UL))
#define FM_CRG_FCSWL_CTL                          *((volatile uint32_t*)(0x4001004CUL))
#define FM0P_CRG_FCSWL_CTL                        *((volatile uint32_t*)(0x4001004CUL))
#define FM_CRG_FCSWD_CTL                          *((volatile uint32_t*)(0x40010050UL))
#define FM0P_CRG_FCSWD_CTL                        *((volatile uint32_t*)(0x40010050UL))
#define FM_CRG_DBWDT_CTL                          *((volatile uint32_t*)(0x40010054UL))
#define FM0P_CRG_DBWDT_CTL                        *((volatile uint32_t*)(0x40010054UL))
#define FM_CRG_INT_ENR                            *((volatile uint32_t*)(0x40010060UL))
#define FM0P_CRG_INT_ENR                          *((volatile uint32_t*)(0x40010060UL))
#define FM_CRG_INT_STR                            *((volatile uint32_t*)(0x40010064UL))
#define FM0P_CRG_INT_STR                          *((volatile uint32_t*)(0x40010064UL))
#define FM_CRG_INT_CLR                            *((volatile uint32_t*)(0x40010068UL))
#define FM0P_CRG_INT_CLR                          *((volatile uint32_t*)(0x40010068UL))

