MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C32C0AGV20000/mcu.h
#define bFM_INTREQ_IRQ04MON_INT0                  *((volatile  uint8_t *)(0x42624280UL))
#define bFM0P_INTREQ_IRQ04MON_INT0                *((volatile  uint8_t *)(0x42624280UL))
#define bFM_INTREQ_IRQ04MON_INT1                  *((volatile  uint8_t *)(0x42624284UL))
#define bFM0P_INTREQ_IRQ04MON_INT1                *((volatile  uint8_t *)(0x42624284UL))
#define bFM_INTREQ_IRQ04MON_INT2                  *((volatile  uint8_t *)(0x42624288UL))
#define bFM0P_INTREQ_IRQ04MON_INT2                *((volatile  uint8_t *)(0x42624288UL))

#define bFM_INTREQ_IRQ05MON_INT0                  *((volatile  uint8_t *)(0x42624300UL))
#define bFM0P_INTREQ_IRQ05MON_INT0                *((volatile  uint8_t *)(0x42624300UL))
#define bFM_INTREQ_IRQ05MON_INT1                  *((volatile  uint8_t *)(0x42624304UL))
#define bFM0P_INTREQ_IRQ05MON_INT1                *((volatile  uint8_t *)(0x42624304UL))
#define bFM_INTREQ_IRQ05MON_INT2                  *((volatile  uint8_t *)(0x42624308UL))
#define bFM0P_INTREQ_IRQ05MON_INT2                *((volatile  uint8_t *)(0x42624308UL))

#define bFM_INTREQ_IRQ06MON_INT0                  *((volatile  uint8_t *)(0x42624380UL))
#define bFM0P_INTREQ_IRQ06MON_INT0                *((volatile  uint8_t *)(0x42624380UL))
#define bFM_INTREQ_IRQ06MON_INT1                  *((volatile  uint8_t *)(0x42624384UL))
#define bFM0P_INTREQ_IRQ06MON_INT1                *((volatile  uint8_t *)(0x42624384UL))
#define bFM_INTREQ_IRQ06MON_INT2                  *((volatile  uint8_t *)(0x42624388UL))
#define bFM0P_INTREQ_IRQ06MON_INT2                *((volatile  uint8_t *)(0x42624388UL))

#define bFM_INTREQ_IRQ07MON_INT0                  *((volatile  uint8_t *)(0x42624400UL))
#define bFM0P_INTREQ_IRQ07MON_INT0                *((volatile  uint8_t *)(0x42624400UL))
#define bFM_INTREQ_IRQ07MON_INT1                  *((volatile  uint8_t *)(0x42624404UL))
#define bFM0P_INTREQ_IRQ07MON_INT1                *((volatile  uint8_t *)(0x42624404UL))
#define bFM_INTREQ_IRQ07MON_INT2                  *((volatile  uint8_t *)(0x42624408UL))
#define bFM0P_INTREQ_IRQ07MON_INT2                *((volatile  uint8_t *)(0x42624408UL))

#define bFM_INTREQ_IRQ08MON_INT0                  *((volatile  uint8_t *)(0x42624480UL))
#define bFM0P_INTREQ_IRQ08MON_INT0                *((volatile  uint8_t *)(0x42624480UL))
#define bFM_INTREQ_IRQ08MON_INT1                  *((volatile  uint8_t *)(0x42624484UL))
#define bFM0P_INTREQ_IRQ08MON_INT1                *((volatile  uint8_t *)(0x42624484UL))
#define bFM_INTREQ_IRQ08MON_INT2                  *((volatile  uint8_t *)(0x42624488UL))
#define bFM0P_INTREQ_IRQ08MON_INT2                *((volatile  uint8_t *)(0x42624488UL))

#define bFM_INTREQ_IRQ09MON_INT0                  *((volatile  uint8_t *)(0x42624500UL))
#define bFM0P_INTREQ_IRQ09MON_INT0                *((volatile  uint8_t *)(0x42624500UL))
#define bFM_INTREQ_IRQ09MON_INT1                  *((volatile  uint8_t *)(0x42624504UL))
#define bFM0P_INTREQ_IRQ09MON_INT1                *((volatile  uint8_t *)(0x42624504UL))
#define bFM_INTREQ_IRQ09MON_INT2                  *((volatile  uint8_t *)(0x42624508UL))
#define bFM0P_INTREQ_IRQ09MON_INT2                *((volatile  uint8_t *)(0x42624508UL))

#define bFM_INTREQ_IRQ10MON_INT0                  *((volatile  uint8_t *)(0x42624580UL))
#define bFM0P_INTREQ_IRQ10MON_INT0                *((volatile  uint8_t *)(0x42624580UL))
#define bFM_INTREQ_IRQ10MON_INT1                  *((volatile  uint8_t *)(0x42624584UL))
#define bFM0P_INTREQ_IRQ10MON_INT1                *((volatile  uint8_t *)(0x42624584UL))
#define bFM_INTREQ_IRQ10MON_INT2                  *((volatile  uint8_t *)(0x42624588UL))
#define bFM0P_INTREQ_IRQ10MON_INT2                *((volatile  uint8_t *)(0x42624588UL))

#define bFM_INTREQ_IRQ11MON_INT0                  *((volatile  uint8_t *)(0x42624600UL))
#define bFM0P_INTREQ_IRQ11MON_INT0                *((volatile  uint8_t *)(0x42624600UL))
#define bFM_INTREQ_IRQ11MON_INT1                  *((volatile  uint8_t *)(0x42624604UL))
#define bFM0P_INTREQ_IRQ11MON_INT1                *((volatile  uint8_t *)(0x42624604UL))
#define bFM_INTREQ_IRQ11MON_INT2                  *((volatile  uint8_t *)(0x42624608UL))
#define bFM0P_INTREQ_IRQ11MON_INT2                *((volatile  uint8_t *)(0x42624608UL))

#define bFM_INTREQ_IRQ12MON_INT0                  *((volatile  uint8_t *)(0x42624680UL))
#define bFM0P_INTREQ_IRQ12MON_INT0                *((volatile  uint8_t *)(0x42624680UL))
#define bFM_INTREQ_IRQ12MON_INT1                  *((volatile  uint8_t *)(0x42624684UL))
#define bFM0P_INTREQ_IRQ12MON_INT1                *((volatile  uint8_t *)(0x42624684UL))
#define bFM_INTREQ_IRQ12MON_INT2                  *((volatile  uint8_t *)(0x42624688UL))
#define bFM0P_INTREQ_IRQ12MON_INT2                *((volatile  uint8_t *)(0x42624688UL))

#define bFM_INTREQ_IRQ13MON_INT0                  *((volatile  uint8_t *)(0x42624700UL))
#define bFM0P_INTREQ_IRQ13MON_INT0                *((volatile  uint8_t *)(0x42624700UL))
#define bFM_INTREQ_IRQ13MON_INT1                  *((volatile  uint8_t *)(0x42624704UL))
#define bFM0P_INTREQ_IRQ13MON_INT1                *((volatile  uint8_t *)(0x42624704UL))
#define bFM_INTREQ_IRQ13MON_INT2                  *((volatile  uint8_t *)(0x42624708UL))
#define bFM0P_INTREQ_IRQ13MON_INT2                *((volatile  uint8_t *)(0x42624708UL))

#define bFM_INTREQ_IRQ14MON_INT0                  *((volatile  uint8_t *)(0x42624780UL))
#define bFM0P_INTREQ_IRQ14MON_INT0                *((volatile  uint8_t *)(0x42624780UL))
#define bFM_INTREQ_IRQ14MON_INT1                  *((volatile  uint8_t *)(0x42624784UL))
#define bFM0P_INTREQ_IRQ14MON_INT1                *((volatile  uint8_t *)(0x42624784UL))
#define bFM_INTREQ_IRQ14MON_INT2                  *((volatile  uint8_t *)(0x42624788UL))
#define bFM0P_INTREQ_IRQ14MON_INT2                *((volatile  uint8_t *)(0x42624788UL))

#define bFM_INTREQ_IRQ15MON_INT0                  *((volatile  uint8_t *)(0x42624800UL))
#define bFM0P_INTREQ_IRQ15MON_INT0                *((volatile  uint8_t *)(0x42624800UL))
#define bFM_INTREQ_IRQ15MON_INT1                  *((volatile  uint8_t *)(0x42624804UL))
#define bFM0P_INTREQ_IRQ15MON_INT1                *((volatile  uint8_t *)(0x42624804UL))
#define bFM_INTREQ_IRQ15MON_INT2                  *((volatile  uint8_t *)(0x42624808UL))
#define bFM0P_INTREQ_IRQ15MON_INT2                *((volatile  uint8_t *)(0x42624808UL))

